src/cf/Catalogs/РекламныеБлокиПечатныхФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РекламныеБлокиПечатныхФорм</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьРекламуВШапке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьРекламуВПодвале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РекламныеБлокиШапка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрисоединенныйФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РекламныеБлокиПечатныхФормПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РекламныеБлокиПодвал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрисоединенныйФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РекламныеБлокиПечатныхФормПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/РекламныеБлокиПечатныхФорм/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ВыводитьРекламуВШапке = Истина;
		Объект.ВыводитьРекламуВПодвале = Истина;
	КонецЕсли;
	
	ЗагрузитьДвоичныеДанныеБаннеров();
	ОбновитьОтображениеБаннеров();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БаннерШапкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сначала необходимо записать объект'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(БаннерШапка) Тогда
		
		ЗаблокироватьДанныеФормыДляРедактирования();
		ДобавитьИзображениеНаКлиенте(ПараметрыДобавляемогоФайлаШапка());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БаннерПодвалНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(БаннерПодвал) Тогда
		
		ЗаблокироватьДанныеФормыДляРедактирования();
		ДобавитьИзображениеНаКлиенте(ПараметрыДобавляемогоФайлаПодвал());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьРекламуВШапкеПриИзменении(Элемент)
	НастроитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьРекламуВПодвалеПриИзменении(Элемент)
	НастроитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПредыдущиеКартинкиШапкаНажатие(Элемент)
	ТекущийБаннерШапка = ТекущийБаннерШапка - 1;
	ОбновитьОтображениеБаннеров();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСледующиеКартинкиШапкаНажатие(Элемент)
	ТекущийБаннерШапка = ТекущийБаннерШапка + 1;
	ОбновитьОтображениеБаннеров();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПредыдущиеКартинкиПодвалНажатие(Элемент)
	ТекущийБаннерПодвал = ТекущийБаннерПодвал - 1;
	ОбновитьОтображениеБаннеров();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСледующиеКартинкиПодвалНажатие(Элемент)
	ТекущийБаннерПодвал = ТекущийБаннерПодвал + 1;
	ОбновитьОтображениеБаннеров();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандыИзображенияШапка(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандыИзображенияПродолжение", ЭтотОбъект, ПараметрыДобавляемогоФайлаШапка());
	
	СписокДоступныхКоманд = Новый СписокЗначений;
	СписокДоступныхКоманд.Добавить("ДобавитьИзображение",    НСтр("ru='Добавить           '"),,БиблиотекаКартинок.СоздатьЭлементСписка);
	Если ЗначениеЗаполнено(БаннерШапка) Тогда
		СписокДоступныхКоманд.Добавить("УдалитьИзображение",     НСтр("ru='Удалить'"),,БиблиотекаКартинок.ПометитьНаУдаление);
		СписокДоступныхКоманд.Добавить("ПросмотретьИзображение", НСтр("ru='Просмотреть'"),,БиблиотекаКартинок.ПолеВводаОткрыть);
	КонецЕсли;
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДоступныхКоманд, ТекущийЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыИзображенияПодвал(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандыИзображенияПродолжение", ЭтотОбъект,  ПараметрыДобавляемогоФайлаПодвал());
	
	СписокДоступныхКоманд = Новый СписокЗначений;
	СписокДоступныхКоманд.Добавить("ДобавитьИзображение",    НСтр("ru='Добавить           '"),,БиблиотекаКартинок.СоздатьЭлементСписка);
	Если ЗначениеЗаполнено(БаннерПодвал) Тогда
		СписокДоступныхКоманд.Добавить("УдалитьИзображение",     НСтр("ru='Удалить'"),,БиблиотекаКартинок.ПометитьНаУдаление);
		СписокДоступныхКоманд.Добавить("ПросмотретьИзображение", НСтр("ru='Просмотреть'"),,БиблиотекаКартинок.ПолеВводаОткрыть);
	КонецЕсли;
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокДоступныхКоманд, ТекущийЭлемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьИзображениеНаКлиенте(ПараметрыДобавляемогоФайла)
	
	Перем ИдентификаторФайла, Фильтр;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ИдентификаторФайла = Новый УникальныйИдентификатор;
		
		Оповещение = Новый ОписаниеОповещения("ПослеДобавленияИзображения", ЭтотОбъект, ПараметрыДобавляемогоФайла);
		Фильтр = РаботаСФайламиУНФКлиентСервер.ФильтрФайловИзображений();
		
		РаботаСФайламиКлиент.ДобавитьФайлы(Объект.Ссылка, ИдентификаторФайла, Фильтр,, Оповещение);
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сначала необходимо записать объект'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияИзображения(Результат, ПараметрыДобавляемогоФайла) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		ИзображениеДляПроверки = Результат[0];
	Иначе
		ИзображениеДляПроверки = Результат;
	КонецЕсли;
	
	Если ТипЗнч(ИзображениеДляПроверки) = Тип("СправочникСсылка.РекламныеБлокиПечатныхФормПрисоединенныеФайлы") Тогда
		ВставитьВТаблицуИзображений(ИзображениеДляПроверки, ПараметрыДобавляемогоФайла);
		ПоказатьОповещениеПользователя(НСтр("ru='Изображение обновлено'"));
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru='Изображение не обновлено'"));
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ВставитьВТаблицуИзображений(Источник, ПараметрыДобавляемогоФайла)
	
	Если ТипЗнч(Источник) = Тип("Массив") И ЗначениеЗаполнено(Источник) Тогда
		
		СсылкаНаПрисоединенныйФайл = Источник[0];
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.РекламныеБлокиПечатныхФормПрисоединенныеФайлы") Тогда
		
		СсылкаНаПрисоединенныйФайл = Источник;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ДвоичныеДанныеФайла				= РаботаСФайламиУНФ.СсылкаНаДвоичныеДанныеФайла(СсылкаНаПрисоединенныйФайл, УникальныйИдентификатор);
	
	НоваяСтрока						= Объект[ПараметрыДобавляемогоФайла.ИмяТабличнойЧасти].Добавить();
	НоваяСтрока.Адрес				= ДвоичныеДанныеФайла;
	НоваяСтрока.ПрисоединенныйФайл	= СсылкаНаПрисоединенныйФайл;
	
	ЭтотОбъект[ПараметрыДобавляемогоФайла.ИмяИндекса] =  Объект[ПараметрыДобавляемогоФайла.ИмяТабличнойЧасти].Индекс(НоваяСтрока);
	ОбновитьОтображениеБаннеров();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеБаннеров()
	
	Если ТекущийБаннерШапка < 0 ИЛИ ТекущийБаннерШапка >= Объект.РекламныеБлокиШапка.Количество() Тогда
		ТекущийБаннерШапка = 0;
	КонецЕсли;
	
	Если ТекущийБаннерПодвал < 0 ИЛИ ТекущийБаннерПодвал >= Объект.РекламныеБлокиПодвал.Количество() Тогда
		ТекущийБаннерПодвал = 0;
	КонецЕсли;
	
	Если Объект.РекламныеБлокиШапка.Количество() > 0 Тогда
		СтрокаБаннера = Объект.РекламныеБлокиШапка.Получить(ТекущийБаннерШапка);
		Если СтрокаБаннера <> Неопределено Тогда
			БаннерШапка = СтрокаБаннера.Адрес;
		КонецЕсли;
	Иначе
		БаннерШапка = "";
	КонецЕсли;
	
	Если Объект.РекламныеБлокиПодвал.Количество() > 0 Тогда
		СтрокаБаннера = Объект.РекламныеБлокиПодвал.Получить(ТекущийБаннерПодвал);
		Если СтрокаБаннера <> Неопределено Тогда
			БаннерПодвал = СтрокаБаннера.Адрес;
		КонецЕсли;
	Иначе
		БаннерПодвал = "";
	КонецЕсли;
	
	НастроитьФорму();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДвоичныеДанныеБаннеров()
	
	Для каждого СтрокаТЧ Из Объект.РекламныеБлокиШапка Цикл
		СтрокаТЧ.Адрес = РаботаСФайламиУНФ.СсылкаНаДвоичныеДанныеФайла(СтрокаТЧ.ПрисоединенныйФайл, УникальныйИдентификатор);
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из Объект.РекламныеБлокиПодвал Цикл
		СтрокаТЧ.Адрес = РаботаСФайламиУНФ.СсылкаНаДвоичныеДанныеФайла(СтрокаТЧ.ПрисоединенныйФайл, УникальныйИдентификатор);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	
	Элементы.ГруппаРекламаШапка.Видимость = Объект.ВыводитьРекламуВШапке;
	Элементы.ГруппаРекламаПодвал.Видимость = Объект.ВыводитьРекламуВПодвале;
	
	Элементы.ДекорацияПредыдущиеКартинкиШапка.Видимость = ТекущийБаннерШапка > 0;
	Элементы.ДекорацияЗаглушкаЛевоШапка.Видимость = ТекущийБаннерШапка = 0;
	Элементы.ДекорацияСледующиеКартинкиШапка.Видимость = ТекущийБаннерШапка < Объект.РекламныеБлокиШапка.Количество()-1;
	
	Элементы.ДекорацияПредыдущиеКартинкиПодвал.Видимость = ТекущийБаннерПодвал > 0;
	Элементы.ДекорацияЗаглушкаЛевоПодвал.Видимость = ТекущийБаннерПодвал = 0;
	Элементы.ДекорацияСледующиеКартинкиПодвал.Видимость = ТекущийБаннерПодвал < Объект.РекламныеБлокиПодвал.Количество()-1;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыИзображенияПродолжение(ВыбранныйЭлемент, ПараметрыФайла) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "УдалитьИзображение" Тогда
		УдалитьИзображение(ПараметрыФайла);
	ИначеЕсли ВыбранныйЭлемент.Значение = "ПросмотретьИзображение" Тогда
		ПросмотретьИзображение(ПараметрыФайла);
	ИначеЕсли ВыбранныйЭлемент.Значение = "ДобавитьИзображение" Тогда
		ДобавитьИзображениеНаКлиенте(ПараметрыФайла);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыДобавляемогоФайлаШапка()
	
	ПараметрыДобавляемогоФайла = Новый Структура;
	ПараметрыДобавляемогоФайла.Вставить("ИмяТабличнойЧасти", "РекламныеБлокиШапка");
	ПараметрыДобавляемогоФайла.Вставить("ИмяИндекса", "ТекущийБаннерШапка");
	
	Возврат ПараметрыДобавляемогоФайла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыДобавляемогоФайлаПодвал()
	
	ПараметрыДобавляемогоФайла = Новый Структура;
	ПараметрыДобавляемогоФайла.Вставить("ИмяТабличнойЧасти", "РекламныеБлокиПодвал");
	ПараметрыДобавляемогоФайла.Вставить("ИмяИндекса", "ТекущийБаннерПодвал");
	
	Возврат ПараметрыДобавляемогоФайла;
	
КонецФункции

&НаКлиенте
Процедура ПросмотретьИзображение(ПараметрыФайла)
	
	Индекс = ЭтотОбъект[ПараметрыФайла.ИмяИндекса];
	СтрокаФайла = Объект[ПараметрыФайла.ИмяТабличнойЧасти].Получить(Индекс);
	
	Если СтрокаФайла <> Неопределено Тогда
		ДанныеФайла = ПолучитьДанныеФайла(СтрокаФайла.ПрисоединенныйФайл, УникальныйИдентификатор);
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзображение(ПараметрыФайла)
	
	Индекс = ЭтотОбъект[ПараметрыФайла.ИмяИндекса];
	СтрокаФайла = Объект[ПараметрыФайла.ИмяТабличнойЧасти].Получить(Индекс);
	
	Если СтрокаФайла <> Неопределено Тогда
		ПометитьНаУдалениеПрисоединенныйФайл(СтрокаФайла.ПрисоединенныйФайл);
		Объект[ПараметрыФайла.ИмяТабличнойЧасти].Удалить(Индекс);
		ЭтотОбъект[ПараметрыФайла.ИмяИндекса] = ЭтотОбъект[ПараметрыФайла.ИмяИндекса] - 1;
		ПоказатьОповещениеПользователя(НСтр("ru='Файл помечен на удаление'"));
	КонецЕсли;
	
	Модифицированность = Истина;
	ОбновитьОтображениеБаннеров();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор)
	
	ДополнительныеПараметры = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ДополнительныеПараметры.ИдентификаторФормы = УникальныйИдентификатор;
	
	Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, ДополнительныеПараметры);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПометитьНаУдалениеПрисоединенныйФайл(Файл)
	
	ПрисоединенныйФайлОбъект = Файл.ПолучитьОбъект();
	ПрисоединенныйФайлОбъект.УстановитьПометкуУдаления(Истина);
	ПрисоединенныйФайлОбъект.Записать();
	
КонецФункции

&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И НЕ Модифицированность Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Справочник.РекламныеБлокиПечатныхФорм", "ПредварительныйПросмотрПечатнойФормыСчетНаОплату",
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка), ЭтотОбъект, Новый Структура);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Сначала необходимо записать объект'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
